{
  "list": [
    {
      "icon": "fab fa-github",
      "title": "GITHUB",
      "text": "Навыки работы с терминалом, создание репозиториев, веток и т.д. Все практические задания в GoIT принимаются через GitHub."
    },
    {
      "icon": "fab fa-html5",
      "title": "HTML 5",
      "text": "Семантичнтическая верстка и работа со спецификацией. Создание текстовых блоков, добавление ссылок, размещение картинок и многое другое."
    },
    {
      "icon": "fab fa-css3",
      "title": "CSS",
      "text": "Приоритетность и наследование, работа с цветами, позиционирование элементов, псевдоклассы и псевдоэлементы, CSS-фильтры и CSS-счетчики, подключение кастомных шрифтов и т.д."
    },
    {
      "icon": "fas fa-th",
      "title": "Flexbox",
      "text": "Современная технология позиционирования элементов в потоке документа."
    },
    {
      "icon": "fas fa-desktop",
      "title": "Адаптивная и отзывчивая верстка",
      "text": "Верстка страницы под различные устройства и ширины экрана. Mobile-first CSS."
    },
    {
      "icon": "fab fa-internet-explorer",
      "title": "Кроссбраузерность. Методологии верстки",
      "text": "Работа со специфичными для разных браузеров свойствами. Использование методологи именования BEM"
    },
    {
      "icon": "fab fa-sass",
      "title": "Автоматизация и препроцессоры",
      "text": "Автоматизация процесса верстки c Gulp. CSS-препроцессор SASS. HTML-препроцессор PUG. В дальнейшем, при изучении JavaScrip я познакомился с PUG более детально."
    },
    {
      "icon": "fab fa-js",
      "title": "Основы JAVASCRIPT",
      "text": "Переменные, примитивные типы данных, основные операторы. Строки, чиcла, преобразование типов. Операторы сравнения, логические операторы. Ветвления. Циклы."
    },
    {
      "icon": "fas fa-layer-group",
      "title": "Массивы",
      "text": "Массивы, элементы, индексация. Методы массивов. Деструктуризация массивов и оператор rest."
    },
    {
      "icon": "fas fa-code",
      "title": "Функции",
      "text": "Обьявление функции и функциональные выражения. Стек вызовов. Область видимости. Псевдомассив arguments и многое другое."
    },
    {
      "icon": "far fa-file-code",
      "title": "Объекты",
      "text": "Свойства и методы объекта. Передача по ссылке и по значению. Перебор объектов. Слияние объектов. Деструктуризация обьектов.Контекст исполнения функции и т.д."
    },
    {
      "icon": "fas fa-bug",
      "title": "Отладка кода и перехват ошибок",
      "text": "Дебаггер. try/catch. throw."
    },
    {
      "icon": "fas fa-project-diagram",
      "title": "Основы ООП",
      "text": "Прототип объекта. Прототипное наследование. Конструкторы. ES6 Классы."
    },
    {
      "icon": "fas fa-stream",
      "title": "DOM",
      "text": "Поиск, создание и добавление DOM-узлов. Оптимизация работы с DOM. BOM. Feature detection."
    },
    {
      "icon": "fas fa-mouse",
      "title": "События",
      "text": "Делегирование событий. События мыши, клавиатуры, форм, touch. Применение техник throttling и debouncing."
    },
    {
      "icon": "fas fa-tasks",
      "title": "Асинхронный JavaScript",
      "text": "Таймеры. Promise API. Протоколы передачи данных. JSON. AJAX. XHR. Fetch API. CORS. WebSockets."
    },
    {
      "icon": "fas fa-cookie-bite",
      "title": "Хранение данных на клиенте",
      "text": "Cookies. WebStorage. IndexedDB"
    },
    {
      "icon": "fab fa-npm",
      "title": "Автоматизация",
      "text": "Node.js и пакетный менеджер npm. Настройка Webpack. Патерн модуля, CommonJS и ES6 модули"
    },
    {
      "icon": "fas fa-ellipsis-h",
      "title": "Дополнительное",
      "text": "Итераторы, генераторы, async/await. Функции высшего порядка. Сложность функции. Шаблонизаторы Handlebars, PUG и многое другое."
    },
    {
      "learning": "inactive",
      "icon": "fab fa-react",
      "title": "REACT",
      "text": "Начало модуля состоится 11 января 2020 года. Модуль продлится примерно 2.5 месяца"
    },
    {
      "learning": "inactive",
      "icon": "fab fa-node-js",
      "title": "NODEJS",
      "text": "Модуль начнётся после окончания предыдущего этапа, длительность примерно 2.5 месяца"
    }
  ]
}
