{
  "list": [
    {
      "icon": "",
      "title": "GITHUB",
      "text": "Навыки работы с терминалом, создание репозиториев, веток и т.д. Все практические задания принимаются через GitHub"
    },
    {
      "icon": "",
      "title": "БЛОЧНАЯ МОДЕЛЬ",
      "text": "Это истоки с которыми нужно было ознакомиться и понимать принципы их работы."
    },
    {
      "icon": "",
      "title": "FLEX AND GRID",
      "text": "Использование inline-block и float уже давно считается дурным тоном, поэтому мы изучили более современные способы позиционирования."
    },
    {
      "icon": "",
      "title": "ФОРМЫ",
      "text": "Сайт – это бизнес! Если вы не можете принимать заказы и обратную связь от клиентов, то вам не нужен такой сайт."
    },
    {
      "icon": "",
      "title": "RESPONSIVE AND ADAPTIVE",
      "text": "Сайт – это бизнес! (на случай если вы не поняли с первого раза) 51.6% от общемирового интернет трафика припадает на смартфоны. Глупо надеяться, что вашему сайту не нужна мобильная версия."
    },
    {
      "icon": "",
      "title": "BOOTSTRAP 4",
      "text": "Адская штука! Примерно такие ощущения после работы с bootstrap. Но всё же в этом тоже есть некий шарм."
    },
    {
      "icon": "",
      "title": "SVG AND RETINA",
      "text": "Работа с svg, создание svg спрайта, адаптация сайта под retina экраны..."
    },
    {
      "icon": "",
      "title": "SASS",
      "text": "Финалом первой части этой эпопеи был хакатон, на котором команды с 5-ти человек создавали лэндинг с использованием Gulp и препроцессора SASS. Мне выпала роль тимлида. Прошу учесть тот факт, что я отвечал за вёрстку хедера."
    },
    {
      "icon": "",
      "title": "JAVASCRIPT",
      "text": "Начало модуля состоялось 05.09.2019. Модуль продлится 2.5 месяца"
    },
    {
      "icon": "",
      "title": "REACT",
      "text": "Начало модуля ориентировочно состоится в ноябре 2019 года. Модуль продлится 2.5 месяца"
    },
    {
      "icon": "",
      "title": "NODEJS",
      "text": "Модуль начнётся после окончания предыдущего этапа, длительность 2.5 месяца"
    }
  ]
}
